package com.javarush.test.level09.lesson11.home05;

import java.io.BufferedReader;
import java.io.InputStreamReader;
import java.util.ArrayList;

/* Гласные и согласные буквы
Написать программу, которая вводит с клавиатуры строку текста.
Программа должна вывести на экран две строки:
1. первая строка содержит только гласные буквы
2. вторая - только согласные буквы и знаки препинания из введённой строки.
Буквы соединять пробелом, каждая строка должна заканчиваться пробелом.

Пример ввода:
Мама мыла раму.
Пример вывода:
а а ы а а у
М м м л р м .
*/

public class Solution
{
    public static void main(String[] args) throws Exception
    {
        BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
        String s = reader.readLine();
        char[] c_arr = s.toCharArray();
        ArrayList<Character> temp1 = new ArrayList<>();
        ArrayList<Character> temp2 = new ArrayList<>();


        for (char s1 : c_arr)
        {
            if (isVowel(s1) == false && s1 != ' ')
            {
                temp1.add(s1);
            }
            if (isVowel(s1) == true)
            {
                temp2.add(s1);
            }

        }

        for (char t2 : temp2)
        {
            System.out.print((char)t2 + " ");
        }
        System.out.println();
        for (char t1 : temp1)
        {

            System.out.print((char)t1 + " ");
        }
        //напишите тут ваш код
    }


    public static char[] vowels = new char[]{'а', 'я', 'у', 'ю', 'и', 'ы', 'э', 'е', 'о', 'ё'};

    //метод проверяет, гласная ли буква
    public static boolean isVowel(char c)
    {
        c = Character.toLowerCase(c);  //приводим символ в нижний регистр - от заглавных к строчным буквам

        for (char d : vowels)   //ищем среди массива гласных
        {
            if (c == d)
                return true;
        }
        return false;
    }
}
